---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCImportOptions.GetExtraOptions
source: html/b47a34ec-ea49-7f3d-ce78-782222abf96e.htm
---
# Autodesk.Revit.DB.IFC.IFCImportOptions.GetExtraOptions Method

Get the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value.

## Syntax (C#)
```csharp
public IDictionary<string, string> GetExtraOptions()
```

## Returns
The list of options.